Repository: dotliquid/dotliquid
Catalog: src/DotLiquid/Properties/Resources.*.resx
Languages: it

# AssignTagSyntaxException
source: Syntax Error in 'assign' tag - Valid syntax: assign [var] = [source]
it: Errore di sintassi nel tag 'assign' - La sintassi corretta è: assign [var] = [valore]

# BlankFileSystemDoesNotAllowIncludesException
source: Error - This liquid context does not allow includes
it: Errore - Il contesto attuale non permette l'inclusione di altri template

# BlockTagAlreadyDefinedException
source: Liquid Error - Block '{0}' already defined
it: Errore Liquid- Blocco '{0}' già definito

# BlockTagNoElseException
source: {0} tag does not expect else tag
it: Il tag {0} non prevede un tag 'else'

# BlockTagNoEndException
source: 'end' is not a valid delimiter for {0} tags. Use {1}
it: 'end' non è un delimitatore valido per i tag {0}. Utilizzare {1}

# BlockTagNotClosedException
source: {0} tag was never closed
it: Il tag {0} non è stato chiuso

# BlockTagNotTerminatedException
source: Tag '{0}' was not properly terminated with regexp: {1}
it: Il tag '{0}' non è stato terminato correttamente con l'espressione regolare: {1}

# BlockTagSyntaxException
source: Syntax Error in 'block' tag - Valid syntax: block [name]
it: Errore di sintassi nel tag 'block' - La sintassi corretta è: block [nome]

# BlockUnknownTagException
source: Unknown tag '{0}'
it: Tag sconosciuto '{0}'

# BlockVariableNotTerminatedException
source: Variable '{0}' was not properly terminated with regexp: {1}
it: La variable '{0}' non è stata terminata correttamente con l'espressione regolare: {1}

# CaptureTagSyntaxException
source: Syntax Error in 'capture' tag - Valid syntax: capture [var]
it: Errore di sintassi nel tag 'capture' - La sintassi corretta è: capture [var]

# CaseTagElseSyntaxException
source: Syntax Error in 'case' tag - Valid else condition: {{% else %}} (no parameters)
it: Errore di sintassi nel tag 'case' - La sintassi condizione 'else' valida è: {{% else %}} (nessun parametro)

# CaseTagSyntaxException
source: Syntax Error in 'case' tag - Valid syntax: case [condition]
it: Erorre di sintassi nel tag 'case' - La sintassi corretta è: case [condizione]

# CaseTagWhenSyntaxException
source: Syntax Error in 'case' tag - Valid when condition: {{% when [condition] [or condition2...] %}}
it: Errore di sintassi nel tag 'case' - La condizione 'when' valida è: {{% when [condizione] [or condizione2...] %}}

# ConditionUnknownOperatorException
source: Unknown operator {0}
it: Operatore sconosciuto {0}

# ContextLiquidError
source: Liquid error: {0}
it: Errore Liquid: {0}

# ContextLiquidSyntaxError
source: Liquid syntax error: {0}
it: Errore di sintassi Liquid: {0}

# ContextObjectInvalidException
source: Object '{0}' is invalid because it is neither a built-in type nor implements ILiquidizable
it: L'oggetto '{0}' non è valido perchè non è un tipo built-in, né implementa l'interfaccia ILiquidizable

# ContextStackException
source: Nesting too deep
it: Annidamento eccessivo

# DropWrongNamingConventionMessage
source: Missing property. Did you mean '{0}'?
it: Proprietà non riconosciuta. Forse intendevi '{0}'?

# ExtendsTagCanBeUsedOneException
source: Liquid Error - 'extends' tag can be used only once
it: Errore Liquid - il tag 'extends' può essere usato una sola volta

# ExtendsTagMustBeFirstTagException
source: Liquid Error - 'extends' must be the first tag in an extending template
it: Errore Liquid - il tag 'extends' deve essere il primo tag definito all'interno di un template che estende un altro template

# ExtendsTagSyntaxException
source: Syntax Error in 'extends' tag - Valid syntax: extends [template]
it: Errre di sintassi nel tag 'extends' - La sintassi corretta è: extends [template]

# ExtendsTagUnallowedTagsException
source: Liquid Error - Only 'comment' and 'block' tags are allowed in an extending template
it: Errore Liquid - Solo i tag 'comment' e 'block' sono consentiti in un template che estende un altro template

# ForTagSyntaxException
source: Syntax Error in 'for' tag - Valid syntax: for [item] in [collection]
it: Errore di sintassi nel tag 'for' - La sintassi corretta è: for [elemento] in [collezione]

# IfTagSyntaxException
source: Syntax Error in 'if' tag - Valid syntax: if [expression]
it: Errore di sintassi nel tag 'if' - La sintassi corretta è: if [espressione]

# IncludeTagSyntaxException
source: Syntax Error in 'include' tag - Valid syntax: include [template]
it: Errore di sintassi nel tag 'include' - La sintassi corretta è: include [template]

# LocalFileSystemIllegalTemplateNameException
source: Error - Illegal template name '{0}'
it: Errore - Nome di template non valido '{0}'

# LocalFileSystemIllegalTemplatePathException
source: Error - Illegal template path '{0}'
it: Errore - Percorso del template non valido '{0}'

# LocalFileSystemTemplateNotFoundException
source: Error - No such template '{0}'
it: Errore - Template non trovato '{0}'

# StrainerFilterHasNoValueException
source: Error - Filter '{0}' does not have a default value for '{1}' and no value was supplied
it: Errore - Il filtro '{0}' non ha un valore predefinito per '{1}' e nessun valore è stato fornito

# TableRowTagSyntaxException
source: Syntax Error in 'tablerow' tag - Valid syntax: tablerow [item] in [collection] cols=[number]
it: Errore di sintassi nel tag 'tablerow' - La sintassi corretta è: tablerow [elemento] in [collezione] cols=[numero]

# VariableFilterNotFoundException
source: Error - Filter '{0}' in '{1}' could not be found.
it: Errore - Il filtro '{0}' in '{1}' non è stato trovato

# VariableNotFoundException
source: Error - Variable '{0}' could not be found
it: Errore - La variabile '{0}' non è stata trovata

# WeakTableKeyNotFoundException
source: key could not be found
it: la chiave non è stata trovata

# IfTagTooMuchConditionsException
source: Syntax Error in 'if' tag - max 500 conditions are allowed
it: Errore di sintassi nel tag 'if' - sono consentite fino 500 condizioni
